** View DB
#+begin_src sqlite :db sqlite.db
select * from devices join provisions where devices.id = provisions.deviceID;
#+end_src

#+RESULTS:
| 2:2:2:4:5:6 | unconfigured device | 2:2:2:4:5:6 | temperature |  22 |
| 2:2:2:4:5:6 | unconfigured device | 2:2:2:4:5:6 | humidity    |  41 |
| c:0:f:f:e:e | fake                | c:0:f:f:e:e | level       | 100 |

#+begin_src sqlite :db sqlite.db
select * from devices join consumptions where devices.id = consumingDeviceID;
#+end_src

#+RESULTS:
|          2:2:2:4:5:6 | unconfigured device |          2:2:2:4:5:6 | date   |             |       |
|          2:2:2:4:5:6 | unconfigured device |          2:2:2:4:5:6 | time   |             |       |
|          2:2:2:4:5:6 | unconfigured device |          2:2:2:4:5:6 | value1 | c:0:f:f:e:e | level |
|          2:2:2:4:5:6 | unconfigured device |          2:2:2:4:5:6 | value2 |             |       |
| 216:58:221:34:102:18 | unconfigured device | 216:58:221:34:102:18 | top    |             |       |
| 216:58:221:34:102:18 | unconfigured device | 216:58:221:34:102:18 | middle |             |       |
| 216:58:221:34:102:18 | unconfigured device | 216:58:221:34:102:18 | bottom |             |       |


#+begin_src sqlite :db sqlite.db
select * from devices join provisions where devices.id = deviceID;
#+end_src

#+RESULTS:
| 2:2:2:4:5:6 | unconfigured device | 2:2:2:4:5:6 | temperature |   0 |
| 2:2:2:4:5:6 | unconfigured device | 2:2:2:4:5:6 | humidity    |   0 |
| c:0:f:f:e:e | fake                | c:0:f:f:e:e | level       | 100 |

** Test get values device consumes

#+begin_src sqlite :db sqlite.db
SELECT consumptions.what, provisions.val
            FROM consumptions
            JOIN provisions
            ON consumptions.producingDeviceID = provisions.deviceID
            AND consumptions.produces = provisions.what
            AND consumptions.consumingDeviceID = '2:2:2:4:5:6'
            AND provisions.val IS NOT NULL;
#+end_src

#+RESULTS:
| value1 | 100 |

